/*
Інтерфейси реалізуються неявно

Тип реалізує інтерфейс шляхом реалізації його методів. Немає явної декларації про наміри, немає ключового
слова "implements".

Неявні інтерфейси відокремлюють визначення інтерфейсу від його реалізації, яка потім може з'явитись у
будь-якому пакеті без попереднього узгодження.
*/
package main

import "fmt"

type I interface {
	M()
}

type T struct {
	S string
}

// Цей спосіб означає, що тип T реалізує інтерфейс I, 
// але не потрібно явно оголошувати, що він це робить.
func (t T) M() {
	fmt.Println(t.S)
}

func main() {
	var i I = T{"hello"}
	i.M()
}
