/*
Інтерфейсні значення з нульовими базовими значеннями
Якщо конкретне значення всередині самого інтерфейсу дорівнює нулю, метод буде викликано з нульовим приймачем.

У деяких мовах це може викликати виключення нульового вказівника, але в Go прийнято писати методи, які 
витончено обробляють виклик з нульовим приймачем (як у випадку з методом M у цьому прикладі).

Зауважте, що значення інтерфейсу, яке містить нульове конкретне значення, саме по собі не є нульовим.
*/
package main

import "fmt"

type I interface {
	M()
}

type T struct {
	S string
}

func (t *T) M() {
	if t == nil {
		fmt.Println("<nil>")
		return
	}
	fmt.Println(t.S)
}

func main() {
	var i I

	var t *T
	i = t
	describe(i)
	i.M()

	i = &T{"hello"}
	describe(i)
	i.M()
}

func describe(i I) {
	fmt.Printf("(%v, %T)\n", i, i)
}
