/*
Затвердження типу

Затвердження типу забезпечує доступ до базового конкретного значення інтерфейсного значення.

	t := i.(T)

Цей оператор стверджує, що інтерфейсне значення i має конкретний тип T і присвоює змінній t базове значення T.

Якщо i не містить T, то оператор викличе паніку.

Для перевірки того, чи інтерфейсне значення має конкретний тип, оператор присвоєння типу може повертати два значення: базове значення та логічне значення, яке повідомляє про успішність виконання оператору.

	t, ok := i.(T)

Якщо i містить T, то t буде базовим значенням, а ok буде істинним.

Якщо ні, то ok буде хибним, а t буде нульовим значенням типу T, і ніякої паніки не відбудеться.

Зверніть увагу на схожість цього синтаксису з синтаксисом читання з карти.
*/
package main

import "fmt"

func main() {
	var i interface{} = "hello"

	s := i.(string)
	fmt.Println(s)

	s, ok := i.(string)
	fmt.Println(s, ok)

	f, ok := i.(float64)
	fmt.Println(f, ok)

	f = i.(float64) // panic
	fmt.Println(f)
}
