/*
Отримувачі поінтерів

Можна оголошувати методи з приймачами поінтерів.

Це означає, що тип отримувача має буквальний синтаксис *T для деякого типу T. (Також, T не може сам 
по собі бути покажчиком, наприклад *int).

Наприклад, метод Scale тут визначений на *Vertex.

Методи з приймачами-покажчиками можуть модифікувати значення, на яке вказує приймач (як це робить тут 
Scale). Оскільки методам часто потрібно модифікувати свій приймач, то приймачі покажчиків є більш 
поширеними, ніж приймачі значень.

Спробуйте забрати символ * з оголошення функції Scale у рядку 16 і поспостерігайте, як зміниться 
поведінка програми.

З приймачем значення метод Scale оперує копією вихідного значення Vertex. (Це така сама поведінка, 
як і для будь-якого іншого аргументу функції). Метод Scale повинен мати приймач-покажчик для зміни 
значення Vertex, оголошеного в головній функції
*/

package main

import (
	"fmt"
	"math"
)

type Vertex struct {
	X, Y float64
}

func (v Vertex) Abs() float64 {
	return math.Sqrt(v.X*v.X + v.Y*v.Y)
}

func (v *Vertex) Scale(f float64) {
	v.X = v.X * f
	v.Y = v.Y * f
}

func main() {
	v := Vertex{3, 4}
	v.Scale(10)
	fmt.Println(v.Abs())
}
