/*
Пакети

Кожна Go програма створена з пакетів.

Програма запускається з пакету main.

Ця програма використовує пакети з шляхами імпорту "fmt" та "math/rand".

За згодою, ім'я пакету співпадає з останнім елементом шляху імпорту.
Наприклад, пакет "math/rand" включає в себе файли, які починаються із пакетом rand.

Зверніть увагу: Середовище, в якому виконуються ці програми, є детермінованим, тому кожен раз, коли ви запускаєте
програму rand.Intn поверне той самий номер.
(Щоб побачити інше число, запустіть генератор чисел; див. rand.Seed. Час на ігровому майданчику постійний, тому ви
потрібно використовувати щось інше.)
*/

package main

import (
	"fmt"
	"math/rand"
)

func main() {
	fmt.Println("My favorite number is", rand.Intn(10))
}
