/*
Типовий висновок
При оголошенні змінної без явного вказівки типу (або за допомогою синтаксису := або var = синтаксису виразу), тип змінної виводиться зі значення в правій частині.

Коли введено праву частину оголошення, нова змінна має той самий тип:

var i int
j := i // j є цілим
Але коли права частина містить нетипову числову константу, новою змінною може бути int, float64 або complex128 залежно від точності константи:

i := 42 // int
f := 3,142 // float64
g := 0,867 + 0,5i // комплекс128
Спробуйте змінити початкове значення v у прикладі коду та спостерігайте, як це вплине на його тип.
*/

package main

import "fmt"

func main() {
	v := 42 // change me!
	fmt.Printf("v is of type %T\n", v)
}
