/*
Перемикач (оператор switch)

Оператор switch — це коротший спосіб написати послідовність операторів if - else.
Він запускає перший випадок, значення якого дорівнює виразу умови.

Перемикач Go подібний до перемикача в C, C++, Java, JavaScript і PHP, за винятком того, 
що Go запускає лише вибраний випадок, а не всі наступні випадки. По суті, оператор break, 
який потрібен наприкінці кожного випадку в цих мовах, надається автоматично в Go. 
Ще одна важлива відмінність полягає в тому, що випадки перемикання Go не обов’язково повинні бути константами, 
а задіяні значення не повинні бути цілими числами.
*/
package main

import (
	"fmt"
	"runtime"
)

func main() {
	fmt.Print("Go runs on ")
	switch os := runtime.GOOS; os {
	case "darwin":
		fmt.Println("OS X.")
	case "linux":
		fmt.Println("Linux.")
	default:
		// freebsd, openbsd,
		// plan9, windows...
		fmt.Printf("%s.\n", os)
	}
}
