/*
Довжина і ємність слайсу

Слайс має як довжину, так і ємність.

Довжина слайсу - це кількість елементів, які він містить.

Ємність слайсу — це кількість елементів у базовому масиві, починаючи з першого елемента фрагмента.

Довжину та ємність слайсу s можна отримати за допомогою виразів len(s) і cap(s).

Ви можете збільшити довжину слайсу, зробивши слайс повторно, за умови, що він має достатню ємність. 
Спробуйте змінити одну з операцій слайсу в прикладі програми, щоб розширити його за межі його можливостей, 
і подивіться, що станеться.
*/
package main

import "fmt"

func main() {
	s := []int{2, 3, 5, 7, 11, 13}
	printSlice(s)

	// Slice the slice to give it zero length.
	s = s[:0]
	printSlice(s)

	// Extend its length.
	s = s[:4]
	printSlice(s)

	// Drop its first two values.
	s = s[2:]
	printSlice(s)
}

func printSlice(s []int) {
	fmt.Printf("len=%d cap=%d %v\n", len(s), cap(s), s)
}
