/*
Вправа: Слайст

Реалізувати програму Pic. Вона повинна повертати відрізок довжини dy, кожен елемент якого є відрізком 
dx 8-бітних цілих беззнакових чисел. Коли ви запустите програму, вона виведе на екран вашу картинку, 
інтерпретуючи цілі числа як значення у відтінках сірого (ну, або синього).

Вибір зображення залишається за вами. Цікавими функціями є (x+y)/2, x*y та x^y.

(Для виділення кожного []uint8 всередині [][]uint8 потрібно використовувати цикл).

(Використовуйте uint8(intValue) для перетворення між типами).
*/

package main

import "golang.org/x/tour/pic"

func Pic(dx, dy int) [][]uint8 {
}

func main() {
	pic.Show(Pic)
}
