/*
Закриття функцій
Функції в Go можуть бути закриттями. Закриття - це значення функції, яке посилається на змінні ззовні 
її тіла. Функція може отримувати доступ до змінних, на які вона посилається, і присвоювати їм 
значення; в цьому сенсі функція "прив'язана" до змінних.

Наприклад, функція додавання повертає замикання. Кожне закриття пов'язане з власною змінною суми.
*/
package main

import "fmt"

func adder() func(int) int {
	sum := 0
	return func(x int) int {
		sum += x
		return sum
	}
}

func main() {
	pos, neg := adder(), adder()
	for i := 0; i < 10; i++ {
		fmt.Println(
			pos(i),
			neg(-2*i),
		)
	}
}
