/*
Слайси (зрізи)
Масив має фіксований розмір. З іншого боку, слайс — це гнучке представлення елементів масиву динамічного 
розміру. На практиці зрізи зустрічаються набагато частіше, ніж масиви.

Тип []T є зрізом з елементами типу T.

Зріз формується шляхом зазначення двох індексів, нижньої та верхньої меж, розділених двокрапкою:

	a [нижня : верхня]

Це вибирає напіввідкритий діапазон, який включає перший елемент, але виключає останній.

Наступний вираз створює фрагмент, який включає елементи з 1 по 3 a:

	a[1:4]
*/
package main

import "fmt"

func main() {
	primes := [6]int{2, 3, 5, 7, 11, 13}

	var s []int = primes[1:4]
	fmt.Println(s)
}
